STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_ca35.h
/***************  Bit definition for DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN  ***/
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_ACTN_Pos  (0U)
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_ACTN_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_ACTN_Pos)  /*!< 0x0000001F */
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_ACTN      DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_ACTN_Msk             /* Remapping input bit on actn DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK0_Pos   (8U)
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK0_Msk   (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK0_Pos)   /*!< 0x00001F00 */
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK0       DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK0_Msk              /* Remapping input bit on bk0 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK1_Pos   (16U)
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK1_Msk   (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK1_Pos)   /*!< 0x001F0000 */
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK1       DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK1_Msk              /* Remapping input bit on bk1 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK2_Pos   (24U)
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK2_Msk   (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK2_Pos)   /*!< 0x1F000000 */
#define DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK2       DDRDBG_DDR34_AC_SWIZZLE_BK2_0_ACTN_DDR34_AC_SWIZZLING_BK2_Msk              /* Remapping input bit on bk2 DDRPHYC input at the DFI interface. */

/***************  Bit definition for DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0  */
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG0_Pos   (0U)
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG0_Msk   (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG0_Pos)   /*!< 0x0000001F */
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG0       DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG0_Msk              /* Remapping input bit on bg0 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG1_Pos   (8U)
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG1_Msk   (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG1_Pos)   /*!< 0x00001F00 */
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG1       DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_BG1_Msk              /* Remapping input bit on bg1 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_CASN_Pos  (16U)
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_CASN_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_CASN_Pos)  /*!< 0x001F0000 */
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_CASN      DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_CASN_Msk             /* Remapping input bit on casn DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_RASN_Pos  (24U)
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_RASN_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_RASN_Pos)  /*!< 0x1F000000 */
#define DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_RASN      DDRDBG_DDR34_AC_SWIZZLE_RASN_CASN_BG1_0_DDR34_AC_SWIZZLING_RASN_Msk             /* Remapping input bit on rasn DDRPHYC input at the DFI interface. */

/***************  Bit definition for DDRDBG_DDR34_AC_SWIZZLE_WEN  **********/
#define DDRDBG_DDR34_AC_SWIZZLE_WEN_DDR34_AC_SWIZZLING_WEN_Pos  (0U)
#define DDRDBG_DDR34_AC_SWIZZLE_WEN_DDR34_AC_SWIZZLING_WEN_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_WEN_DDR34_AC_SWIZZLING_WEN_Pos)   /*!< 0x0000001F */
#define DDRDBG_DDR34_AC_SWIZZLE_WEN_DDR34_AC_SWIZZLING_WEN      DDRDBG_DDR34_AC_SWIZZLE_WEN_DDR34_AC_SWIZZLING_WEN_Msk              /* Remapping input bit on wen DDRPHYC input at the DFI interface. */

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DMA_SECCFGR register  ****************/
#define DMA_VER_V1_3

#define DMA_SECCFGR_SEC0_Pos     (0U)
#define DMA_SECCFGR_SEC0_Msk     (0x1UL << DMA_SECCFGR_SEC0_Pos)                /*!< 0x00000001 */
#define DMA_SECCFGR_SEC0         DMA_SECCFGR_SEC0_Msk                          /*!< Secure State of Channel 0 */
#define DMA_SECCFGR_SEC1_Pos     (1U)
#define DMA_SECCFGR_SEC1_Msk     (0x1UL << DMA_SECCFGR_SEC1_Pos)                /*!< 0x00000002 */
#define DMA_SECCFGR_SEC1         DMA_SECCFGR_SEC1_Msk                          /*!< Secure State of Channel 1 */
#define DMA_SECCFGR_SEC2_Pos     (2U)
#define DMA_SECCFGR_SEC2_Msk     (0x1UL << DMA_SECCFGR_SEC2_Pos)                /*!< 0x00000004 */
#define DMA_SECCFGR_SEC2         DMA_SECCFGR_SEC2_Msk                          /*!< Secure State of Channel 2 */
#define DMA_SECCFGR_SEC3_Pos     (3U)
#define DMA_SECCFGR_SEC3_Msk     (0x1UL << DMA_SECCFGR_SEC3_Pos)                /*!< 0x00000008 */
#define DMA_SECCFGR_SEC3         DMA_SECCFGR_SEC3_Msk                          /*!< Secure State of Channel 3 */
#define DMA_SECCFGR_SEC4_Pos     (4U)
#define DMA_SECCFGR_SEC4_Msk     (0x1UL << DMA_SECCFGR_SEC4_Pos)                /*!< 0x00000010 */
#define DMA_SECCFGR_SEC4         DMA_SECCFGR_SEC4_Msk                          /*!< Secure State of Channel 4 */
#define DMA_SECCFGR_SEC5_Pos     (5U)
#define DMA_SECCFGR_SEC5_Msk     (0x1UL << DMA_SECCFGR_SEC5_Pos)                /*!< 0x00000020 */
#define DMA_SECCFGR_SEC5         DMA_SECCFGR_SEC5_Msk                          /*!< Secure State of Channel 5 */
#define DMA_SECCFGR_SEC6_Pos     (6U)
#define DMA_SECCFGR_SEC6_Msk     (0x1UL << DMA_SECCFGR_SEC6_Pos)                /*!< 0x00000040 */
#define DMA_SECCFGR_SEC6         DMA_SECCFGR_SEC6_Msk                          /*!< Secure State of Channel 6 */
#define DMA_SECCFGR_SEC7_Pos     (7U)
#define DMA_SECCFGR_SEC7_Msk     (0x1UL << DMA_SECCFGR_SEC7_Pos)                /*!< 0x00000080 */
#define DMA_SECCFGR_SEC7         DMA_SECCFGR_SEC7_Msk                          /*!< Secure State of Channel 7 */
#define DMA_SECCFGR_SEC8_Pos     (8U)
#define DMA_SECCFGR_SEC8_Msk     (0x1UL << DMA_SECCFGR_SEC8_Pos)                /*!< 0x00000100 */
#define DMA_SECCFGR_SEC8         DMA_SECCFGR_SEC8_Msk                          /*!< Secure State of Channel 8 */
#define DMA_SECCFGR_SEC9_Pos     (9U)
#define DMA_SECCFGR_SEC9_Msk     (0x1UL << DMA_SECCFGR_SEC9_Pos)                /*!< 0x00000200 */
#define DMA_SECCFGR_SEC9         DMA_SECCFGR_SEC9_Msk                          /*!< Secure State of Channel 9 */
#define DMA_SECCFGR_SEC10_Pos    (10U)
#define DMA_SECCFGR_SEC10_Msk    (0x1UL << DMA_SECCFGR_SEC10_Pos)               /*!< 0x00000400 */
#define DMA_SECCFGR_SEC10        DMA_SECCFGR_SEC10_Msk                         /*!< Secure State of Channel 10 */
#define DMA_SECCFGR_SEC11_Pos    (11U)
#define DMA_SECCFGR_SEC11_Msk    (0x1UL << DMA_SECCFGR_SEC11_Pos)               /*!< 0x00000800 */
#define DMA_SECCFGR_SEC11        DMA_SECCFGR_SEC11_Msk                         /*!< Secure State of Channel 11 */
#define DMA_SECCFGR_SEC12_Pos    (12U)
#define DMA_SECCFGR_SEC12_Msk    (0x1UL << DMA_SECCFGR_SEC12_Pos)               /*!< 0x00001000 */
#define DMA_SECCFGR_SEC12        DMA_SECCFGR_SEC12_Msk                         /*!< Secure State of Channel 12 */
#define DMA_SECCFGR_SEC13_Pos    (13U)
#define DMA_SECCFGR_SEC13_Msk    (0x1UL << DMA_SECCFGR_SEC13_Pos)               /*!< 0x00002000 */
#define DMA_SECCFGR_SEC13        DMA_SECCFGR_SEC13_Msk                         /*!< Secure State of Channel 13 */
#define DMA_SECCFGR_SEC14_Pos    (14U)
#define DMA_SECCFGR_SEC14_Msk    (0x1UL << DMA_SECCFGR_SEC14_Pos)               /*!< 0x00004000 */
#define DMA_SECCFGR_SEC14        DMA_SECCFGR_SEC14_Msk                         /*!< Secure State of Channel 14 */
#define DMA_SECCFGR_SEC15_Pos    (15U)
#define DMA_SECCFGR_SEC15_Msk    (0x1UL << DMA_SECCFGR_SEC15_Pos)               /*!< 0x00008000 */
#define DMA_SECCFGR_SEC15        DMA_SECCFGR_SEC14_Msk                         /*!< Secure State of Channel 15 */

