STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_ca35.h
/*******************  Bit definition for DSI_GHCR register  *******************/
#define DSI_GHCR_DT_Pos             (0U)
#define DSI_GHCR_DT_Msk             (0x3FUL << DSI_GHCR_DT_Pos)           /*!< 0x0000003F */
#define DSI_GHCR_DT                 DSI_GHCR_DT_Msk                      /*!< Type */
#define DSI_GHCR_VCID_Pos           (6U)
#define DSI_GHCR_VCID_Msk           (0x3UL << DSI_GHCR_VCID_Pos)          /*!< 0x000000C0 */
#define DSI_GHCR_VCID               DSI_GHCR_VCID_Msk                    /*!< Channel */
#define DSI_GHCR_WCLSB_Pos          (8U)
#define DSI_GHCR_WCLSB_Msk          (0xFFUL << DSI_GHCR_WCLSB_Pos)        /*!< 0x0000FF00 */
#define DSI_GHCR_WCLSB              DSI_GHCR_WCLSB_Msk                   /*!< WordCount LSB */
#define DSI_GHCR_WCMSB_Pos          (16U)
#define DSI_GHCR_WCMSB_Msk          (0xFFUL << DSI_GHCR_WCMSB_Pos)        /*!< 0x00FF0000 */
#define DSI_GHCR_WCMSB              DSI_GHCR_WCMSB_Msk                   /*!< WordCount MSB */

/*******************  Bit definition for DSI_GPDR register  *******************/
#define DSI_GPDR_DATA1_Pos          (0U)
#define DSI_GPDR_DATA1_Msk          (0xFFUL << DSI_GPDR_DATA1_Pos)        /*!< 0x000000FF */
#define DSI_GPDR_DATA1              DSI_GPDR_DATA1_Msk                   /*!< Payload byte 1 */
#define DSI_GPDR_DATA2_Pos          (8U)
#define DSI_GPDR_DATA2_Msk          (0xFFUL << DSI_GPDR_DATA2_Pos)        /*!< 0x0000FF00 */
#define DSI_GPDR_DATA2              DSI_GPDR_DATA2_Msk                   /*!< Payload byte 2 */
#define DSI_GPDR_DATA3_Pos          (16U)
#define DSI_GPDR_DATA3_Msk          (0xFFUL << DSI_GPDR_DATA3_Pos)        /*!< 0x00FF0000 */
#define DSI_GPDR_DATA3              DSI_GPDR_DATA3_Msk                   /*!< Payload byte 3 */
#define DSI_GPDR_DATA4_Pos          (24U)
#define DSI_GPDR_DATA4_Msk          (0xFFUL << DSI_GPDR_DATA4_Pos)        /*!< 0xFF000000 */
#define DSI_GPDR_DATA4              DSI_GPDR_DATA4_Msk                   /*!< Payload byte 4 */

/*******************  Bit definition for DSI_GPSR register  *******************/
#define DSI_GPSR_CMDFE_Pos          (0U)
#define DSI_GPSR_CMDFE_Msk          (0x1UL << DSI_GPSR_CMDFE_Pos)         /*!< 0x00000001 */
#define DSI_GPSR_CMDFE              DSI_GPSR_CMDFE_Msk                   /*!< Command FIFO empty */
#define DSI_GPSR_CMDFF_Pos          (1U)
#define DSI_GPSR_CMDFF_Msk          (0x1UL << DSI_GPSR_CMDFF_Pos)         /*!< 0x00000002 */
#define DSI_GPSR_CMDFF              DSI_GPSR_CMDFF_Msk                   /*!< Command FIFO full */
#define DSI_GPSR_PWRFE_Pos          (2U)
#define DSI_GPSR_PWRFE_Msk          (0x1UL << DSI_GPSR_PWRFE_Pos)         /*!< 0x00000004 */
#define DSI_GPSR_PWRFE              DSI_GPSR_PWRFE_Msk                   /*!< Payload write FIFO empty */
#define DSI_GPSR_PWRFF_Pos          (3U)
#define DSI_GPSR_PWRFF_Msk          (0x1UL << DSI_GPSR_PWRFF_Pos)         /*!< 0x00000008 */
#define DSI_GPSR_PWRFF              DSI_GPSR_PWRFF_Msk                   /*!< Payload write FIFO full */
#define DSI_GPSR_PRDFE_Pos          (4U)
#define DSI_GPSR_PRDFE_Msk          (0x1UL << DSI_GPSR_PRDFE_Pos)         /*!< 0x00000010 */
#define DSI_GPSR_PRDFE              DSI_GPSR_PRDFE_Msk                   /*!< Payload read FIFO empty */
#define DSI_GPSR_PRDFF_Pos          (5U)
#define DSI_GPSR_PRDFF_Msk          (0x1UL << DSI_GPSR_PRDFF_Pos)         /*!< 0x00000020 */
#define DSI_GPSR_PRDFF              DSI_GPSR_PRDFF_Msk                   /*!< Payload read FIFO full */
#define DSI_GPSR_RCB_Pos            (6U)
#define DSI_GPSR_RCB_Msk            (0x1UL << DSI_GPSR_RCB_Pos)           /*!< 0x00000040 */
#define DSI_GPSR_RCB                DSI_GPSR_RCB_Msk                     /*!< Read command busy */

/******************  Bit definition for DSI_TCCR0 register  *******************/
#define DSI_TCCR0_LPRX_TOCNT_Pos    (0U)
#define DSI_TCCR0_LPRX_TOCNT_Msk    (0xFFFFUL << DSI_TCCR0_LPRX_TOCNT_Pos)/*!< 0x0000FFFF */
#define DSI_TCCR0_LPRX_TOCNT        DSI_TCCR0_LPRX_TOCNT_Msk             /*!< Low-power reception timeout counter */
#define DSI_TCCR0_HSTX_TOCNT_Pos    (16U)
#define DSI_TCCR0_HSTX_TOCNT_Msk    (0xFFFFUL << DSI_TCCR0_HSTX_TOCNT_Pos)/*!< 0xFFFF0000 */
#define DSI_TCCR0_HSTX_TOCNT        DSI_TCCR0_HSTX_TOCNT_Msk             /*!< High-speed transmission timeout counter */

/******************  Bit definition for DSI_TCCR1 register  *******************/
#define DSI_TCCR1_HSRD_TOCNT_Pos    (0U)
#define DSI_TCCR1_HSRD_TOCNT_Msk    (0xFFFFUL << DSI_TCCR1_HSRD_TOCNT_Pos)/*!< 0x0000FFFF */
#define DSI_TCCR1_HSRD_TOCNT        DSI_TCCR1_HSRD_TOCNT_Msk             /*!< High-speed read timeout counter */

/******************  Bit definition for DSI_TCCR2 register  *******************/
#define DSI_TCCR2_LPRD_TOCNT_Pos    (0U)
#define DSI_TCCR2_LPRD_TOCNT_Msk    (0xFFFFUL << DSI_TCCR2_LPRD_TOCNT_Pos)/*!< 0x0000FFFF */
#define DSI_TCCR2_LPRD_TOCNT        DSI_TCCR2_LPRD_TOCNT_Msk             /*!< Low-power read timeout counter */

/******************  Bit definition for DSI_TCCR3 register  *******************/
#define DSI_TCCR3_HSWR_TOCNT_Pos    (0U)
#define DSI_TCCR3_HSWR_TOCNT_Msk    (0xFFFFUL << DSI_TCCR3_HSWR_TOCNT_Pos)/*!< 0x0000FFFF */
#define DSI_TCCR3_HSWR_TOCNT        DSI_TCCR3_HSWR_TOCNT_Msk             /*!< High-speed write timeout counter */
#define DSI_TCCR3_PM_Pos            (24U)
#define DSI_TCCR3_PM_Msk            (0x1UL << DSI_TCCR3_PM_Pos)           /*!< 0x01000000 */
#define DSI_TCCR3_PM                DSI_TCCR3_PM_Msk                     /*!< Presp mode */

/******************  Bit definition for DSI_TCCR4 register  *******************/
#define DSI_TCCR4_LPWR_TOCNT_Pos    (0U)
#define DSI_TCCR4_LPWR_TOCNT_Msk    (0xFFFFUL << DSI_TCCR4_LPWR_TOCNT_Pos)/*!< 0x0000FFFF */
#define DSI_TCCR4_LPWR_TOCNT        DSI_TCCR4_LPWR_TOCNT_Msk             /*!< Low-power write timeout counter */

/******************  Bit definition for DSI_TCCR5 register  *******************/
#define DSI_TCCR5_BTA_TOCNT_Pos     (0U)
#define DSI_TCCR5_BTA_TOCNT_Msk     (0xFFFFUL << DSI_TCCR5_BTA_TOCNT_Pos) /*!< 0x0000FFFF */
#define DSI_TCCR5_BTA_TOCNT         DSI_TCCR5_BTA_TOCNT_Msk              /*!< Bus-turn-around timeout counter */

/*******************  Bit definition for DSI_TDCR register  *******************/
#define DSI_TDCR_M3D_Pos            (0U)
#define DSI_TDCR_M3D_Msk            (0x3UL << DSI_TDCR_M3D_Pos)           /*!< 0x00000003 */
#define DSI_TDCR_M3D                DSI_TDCR_M3D_Msk                     /*!< 3D mode */
#define DSI_TDCR_F3D_Pos            (2U)
#define DSI_TDCR_F3D_Msk            (0x3UL << DSI_TDCR_F3D_Pos)           /*!< 0x0000000C */
#define DSI_TDCR_F3D                DSI_TDCR_F3D_Msk                     /*!< 3D format */
#define DSI_TDCR_SVS_Pos            (4U)
#define DSI_TDCR_SVS_Msk            (0x1UL << DSI_TDCR_SVS_Pos)           /*!< 0x00000010 */
#define DSI_TDCR_SVS                DSI_TDCR_SVS_Msk                     /*!< Second VSYNC */
#define DSI_TDCR_RF_Pos             (5U)
#define DSI_TDCR_RF_Msk             (0x1UL << DSI_TDCR_RF_Pos)            /*!< 0x00000020 */
#define DSI_TDCR_RF                 DSI_TDCR_RF_Msk                      /*!< Right first */
#define DSI_TDCR_S3DC_Pos           (16U)
#define DSI_TDCR_S3DC_Msk           (0x1UL << DSI_TDCR_S3DC_Pos)          /*!< 0x00010000 */
#define DSI_TDCR_S3DC               DSI_TDCR_S3DC_Msk                    /*!< Send 3D control */

/*******************  Bit definition for DSI_CLCR register  *******************/
#define DSI_CLCR_DPCC_Pos           (0U)
#define DSI_CLCR_DPCC_Msk           (0x1UL << DSI_CLCR_DPCC_Pos)          /*!< 0x00000001 */
#define DSI_CLCR_DPCC               DSI_CLCR_DPCC_Msk                    /*!< D-PHY clock control */
#define DSI_CLCR_ACR_Pos            (1U)
#define DSI_CLCR_ACR_Msk            (0x1UL << DSI_CLCR_ACR_Pos)           /*!< 0x00000002 */
#define DSI_CLCR_ACR                DSI_CLCR_ACR_Msk                     /*!< Automatic clock lane control */

