STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_ca35.h
/******************  Bit definition for LVDS_PSFCR register  ******************/
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL0_Pos               (0U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL0_Msk               (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL0_Pos)               /*!< 0x00000001 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL0                   LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL0_Msk                         /*!< Flips the clock edge used by the pre-driver, data lane0 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL1_Pos               (1U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL1_Msk               (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL1_Pos)               /*!< 0x00000002 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL1                   LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL1_Msk                         /*!< Flips the clock edge used by the pre-driver, data lane1 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL2_Pos               (2U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL2_Msk               (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL2_Pos)               /*!< 0x00000004 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL2                   LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL2_Msk                         /*!< Flips the clock edge used by the pre-driver, data lane2 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL3_Pos               (3U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL3_Msk               (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL3_Pos)               /*!< 0x00000008 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL3                   LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL3_Msk                         /*!< Flips the clock edge used by the pre-driver, data lane3 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL4_Pos               (4U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL4_Msk               (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL4_Pos)               /*!< 0x00000010 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL4                   LVDS_PSFCR_SLV_FLIP_CLK_EDGE_ANA_DL4_Msk                         /*!< Flips the clock edge used by the pre-driver, data lane4 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL0_Pos                   (16U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL0_Msk                   (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL0_Pos)                   /*!< 0x00010000 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL0                       LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL0_Msk                             /*!< Flips the clock edge used by the first analog stage to resample the incoming data stream, data lane0 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL1_Pos                   (17U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL1_Msk                   (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL1_Pos)                   /*!< 0x00020000 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL1                       LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL1_Msk                             /*!< Flips the clock edge used by the first analog stage to resample the incoming data stream, data lane1 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL2_Pos                   (18U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL2_Msk                   (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL2_Pos)                   /*!< 0x00040000 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL2                       LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL2_Msk                             /*!< Flips the clock edge used by the first analog stage to resample the incoming data stream, data lane2 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL3_Pos                   (19U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL3_Msk                   (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL3_Pos)                   /*!< 0x00080000 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL3                       LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL3_Msk                             /*!< Flips the clock edge used by the first analog stage to resample the incoming data stream, data lane3 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL4_Pos                   (20U)
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL4_Msk                   (0x1UL << LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL4_Pos)                   /*!< 0x00100000 */
#define LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL4                       LVDS_PSFCR_SLV_FLIP_CLK_EDGE_DL4_Msk                             /*!< Flips the clock edge used by the first analog stage to resample the incoming data stream, data lane4 */

/******************  Bit definition for LVDS_PSSCR register  ******************/
#define LVDS_PSSCR_SLV_SER_SWAP_DPDN_Pos                       (0U)
#define LVDS_PSSCR_SLV_SER_SWAP_DPDN_Msk                       (0x1FUL << LVDS_PSSCR_SLV_SER_SWAP_DPDN_Pos)                      /*!< 0x0000001F */
#define LVDS_PSSCR_SLV_SER_SWAP_DPDN                           LVDS_PSSCR_SLV_SER_SWAP_DPDN_Msk                                 /*!< Inverts output data */
#define LVDS_PSSCR_SLV_SER_SWAP_DPDN_0                         (0x1UL << LVDS_PSSCR_SLV_SER_SWAP_DPDN_Pos)                       /*!< 0x00000001 */
#define LVDS_PSSCR_SLV_SER_SWAP_DPDN_1                         (0x2UL << LVDS_PSSCR_SLV_SER_SWAP_DPDN_Pos)                       /*!< 0x00000002 */
#define LVDS_PSSCR_SLV_SER_SWAP_DPDN_2                         (0x4UL << LVDS_PSSCR_SLV_SER_SWAP_DPDN_Pos)                       /*!< 0x00000004 */
#define LVDS_PSSCR_SLV_SER_SWAP_DPDN_3                         (0x8UL << LVDS_PSSCR_SLV_SER_SWAP_DPDN_Pos)                       /*!< 0x00000008 */
#define LVDS_PSSCR_SLV_SER_SWAP_DPDN_4                         (0x10UL << LVDS_PSSCR_SLV_SER_SWAP_DPDN_Pos)                      /*!< 0x00000010 */
#define LVDS_PSSCR_SLV_SER_DATA_OK_Pos                         (16U)
#define LVDS_PSSCR_SLV_SER_DATA_OK_Msk                         (0x1UL << LVDS_PSSCR_SLV_SER_DATA_OK_Pos)                         /*!< 0x00010000 */
#define LVDS_PSSCR_SLV_SER_DATA_OK                             LVDS_PSSCR_SLV_SER_DATA_OK_Msk                                   /*!< Indicates transmission of data */

/*****************  Bit definition for LVDS_PSSCR1 register  ******************/
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos                       (0U)
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_Msk                       (0xFFUL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                      /*!< 0x000000FF */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE                           LVDS_PSSCR1_SLV_DRV_A0_SPARE_Msk                                 /*!< Spare inputs for data lane0 */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_0                         (0x1UL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                       /*!< 0x00000001 */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_1                         (0x2UL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                       /*!< 0x00000002 */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_2                         (0x4UL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                       /*!< 0x00000004 */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_3                         (0x8UL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                       /*!< 0x00000008 */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_4                         (0x10UL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                      /*!< 0x00000010 */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_5                         (0x20UL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                      /*!< 0x00000020 */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_6                         (0x40UL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                      /*!< 0x00000040 */
#define LVDS_PSSCR1_SLV_DRV_A0_SPARE_7                         (0x80UL << LVDS_PSSCR1_SLV_DRV_A0_SPARE_Pos)                      /*!< 0x00000080 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos                       (8U)
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_Msk                       (0xFFUL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                      /*!< 0x0000FF00 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE                           LVDS_PSSCR1_SLV_DRV_A1_SPARE_Msk                                 /*!< Spare inputs for data lane1 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_0                         (0x1UL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                     /*!< 0x00000100 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_1                         (0x2UL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                     /*!< 0x00000200 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_2                         (0x4UL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                     /*!< 0x00000400 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_3                         (0x8UL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                     /*!< 0x00000800 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_4                         (0x10UL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                    /*!< 0x00001000 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_5                         (0x20UL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                    /*!< 0x00002000 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_6                         (0x40UL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                    /*!< 0x00004000 */
#define LVDS_PSSCR1_SLV_DRV_A1_SPARE_7                         (0x80UL << LVDS_PSSCR1_SLV_DRV_A1_SPARE_Pos)                    /*!< 0x00008000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos                       (16U)
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_Msk                       (0xFFUL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                      /*!< 0x00FF0000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE                           LVDS_PSSCR1_SLV_DRV_A2_SPARE_Msk                                 /*!< Spare inputs for data lane2 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_0                         (0x1UL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                   /*!< 0x00010000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_1                         (0x2UL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                   /*!< 0x00020000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_2                         (0x4UL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                   /*!< 0x00040000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_3                         (0x8UL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                   /*!< 0x00080000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_4                         (0x10UL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                  /*!< 0x00100000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_5                         (0x20UL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                  /*!< 0x00200000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_6                         (0x40UL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                  /*!< 0x00400000 */
#define LVDS_PSSCR1_SLV_DRV_A2_SPARE_7                         (0x80UL << LVDS_PSSCR1_SLV_DRV_A2_SPARE_Pos)                  /*!< 0x00800000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos                       (24U)
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_Msk                       (0xFFUL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                      /*!< 0xFF000000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE                           LVDS_PSSCR1_SLV_DRV_A3_SPARE_Msk                                 /*!< Spare inputs for data lane3 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_0                         (0x1UL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                 /*!< 0x01000000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_1                         (0x2UL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                 /*!< 0x02000000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_2                         (0x4UL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                 /*!< 0x04000000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_3                         (0x8UL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                 /*!< 0x08000000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_4                         (0x10UL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                /*!< 0x10000000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_5                         (0x20UL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                /*!< 0x20000000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_6                         (0x40UL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                /*!< 0x40000000 */
#define LVDS_PSSCR1_SLV_DRV_A3_SPARE_7                         (0x80UL << LVDS_PSSCR1_SLV_DRV_A3_SPARE_Pos)                /*!< 0x80000000 */

/*****************  Bit definition for LVDS_PSSCR2 register  ******************/
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos                       (0U)
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_Msk                       (0xFFUL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                      /*!< 0x000000FF */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE                           LVDS_PSSCR2_SLV_DRV_A4_SPARE_Msk                                 /*!< Spare inputs for data lane4 */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_0                         (0x1UL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                       /*!< 0x00000001 */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_1                         (0x2UL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                       /*!< 0x00000002 */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_2                         (0x4UL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                       /*!< 0x00000004 */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_3                         (0x8UL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                       /*!< 0x00000008 */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_4                         (0x10UL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                      /*!< 0x00000010 */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_5                         (0x20UL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                      /*!< 0x00000020 */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_6                         (0x40UL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                      /*!< 0x00000040 */
#define LVDS_PSSCR2_SLV_DRV_A4_SPARE_7                         (0x80UL << LVDS_PSSCR2_SLV_DRV_A4_SPARE_Pos)                      /*!< 0x00000080 */

/*****************  Bit definition for LVDS_PSBCR1 register  ******************/
#define LVDS_PSBCR1_SLV_EN_BIAS_DL0_Pos                        (0U)
#define LVDS_PSBCR1_SLV_EN_BIAS_DL0_Msk                        (0x1UL << LVDS_PSBCR1_SLV_EN_BIAS_DL0_Pos)                        /*!< 0x00000001 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL0                            LVDS_PSBCR1_SLV_EN_BIAS_DL0_Msk                                  /*!< Enable the local bias at data lane0 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL1_Pos                        (4U)
#define LVDS_PSBCR1_SLV_EN_BIAS_DL1_Msk                        (0x1UL << LVDS_PSBCR1_SLV_EN_BIAS_DL1_Pos)                        /*!< 0x00000010 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL1                            LVDS_PSBCR1_SLV_EN_BIAS_DL1_Msk                                  /*!< Enable the local bias at data lane1 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL2_Pos                        (8U)
#define LVDS_PSBCR1_SLV_EN_BIAS_DL2_Msk                        (0x1UL << LVDS_PSBCR1_SLV_EN_BIAS_DL2_Pos)                        /*!< 0x00000100 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL2                            LVDS_PSBCR1_SLV_EN_BIAS_DL2_Msk                                  /*!< Enable the local bias at data lane2 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL3_Pos                        (12U)
#define LVDS_PSBCR1_SLV_EN_BIAS_DL3_Msk                        (0x1UL << LVDS_PSBCR1_SLV_EN_BIAS_DL3_Pos)                        /*!< 0x00001000 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL3                            LVDS_PSBCR1_SLV_EN_BIAS_DL3_Msk                                  /*!< Enable the local bias at data lane3 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL4_Pos                        (16U)
#define LVDS_PSBCR1_SLV_EN_BIAS_DL4_Msk                        (0x1UL << LVDS_PSBCR1_SLV_EN_BIAS_DL4_Pos)                        /*!< 0x00010000 */
#define LVDS_PSBCR1_SLV_EN_BIAS_DL4                            LVDS_PSBCR1_SLV_EN_BIAS_DL4_Msk                                  /*!< Enable the local bias at data lane4 */

