STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_ca35.h
/* Bit fields for RCC_GPIOECFGR register */
#define RCC_GPIOECFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOECFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOECFGR_GPIOxRST_Pos)
#define RCC_GPIOECFGR_GPIOxRST                       RCC_GPIOECFGR_GPIOxRST_Msk
#define RCC_GPIOECFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOECFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOECFGR_GPIOxEN_Pos)
#define RCC_GPIOECFGR_GPIOxEN                        RCC_GPIOECFGR_GPIOxEN_Msk
#define RCC_GPIOECFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOECFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOECFGR_GPIOxLPEN_Pos)
#define RCC_GPIOECFGR_GPIOxLPEN                      RCC_GPIOECFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOFCFGR register */
#define RCC_GPIOFCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOFCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOFCFGR_GPIOxRST_Pos)
#define RCC_GPIOFCFGR_GPIOxRST                       RCC_GPIOFCFGR_GPIOxRST_Msk
#define RCC_GPIOFCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOFCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOFCFGR_GPIOxEN_Pos)
#define RCC_GPIOFCFGR_GPIOxEN                        RCC_GPIOFCFGR_GPIOxEN_Msk
#define RCC_GPIOFCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOFCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOFCFGR_GPIOxLPEN_Pos)
#define RCC_GPIOFCFGR_GPIOxLPEN                      RCC_GPIOFCFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOGCFGR register */
#define RCC_GPIOGCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOGCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOGCFGR_GPIOxRST_Pos)
#define RCC_GPIOGCFGR_GPIOxRST                       RCC_GPIOGCFGR_GPIOxRST_Msk
#define RCC_GPIOGCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOGCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOGCFGR_GPIOxEN_Pos)
#define RCC_GPIOGCFGR_GPIOxEN                        RCC_GPIOGCFGR_GPIOxEN_Msk
#define RCC_GPIOGCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOGCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOGCFGR_GPIOxLPEN_Pos)
#define RCC_GPIOGCFGR_GPIOxLPEN                      RCC_GPIOGCFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOHCFGR register */
#define RCC_GPIOHCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOHCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOHCFGR_GPIOxRST_Pos)
#define RCC_GPIOHCFGR_GPIOxRST                       RCC_GPIOHCFGR_GPIOxRST_Msk
#define RCC_GPIOHCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOHCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOHCFGR_GPIOxEN_Pos)
#define RCC_GPIOHCFGR_GPIOxEN                        RCC_GPIOHCFGR_GPIOxEN_Msk
#define RCC_GPIOHCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOHCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOHCFGR_GPIOxLPEN_Pos)
#define RCC_GPIOHCFGR_GPIOxLPEN                      RCC_GPIOHCFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOICFGR register */
#define RCC_GPIOICFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOICFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOICFGR_GPIOxRST_Pos)
#define RCC_GPIOICFGR_GPIOxRST                       RCC_GPIOICFGR_GPIOxRST_Msk
#define RCC_GPIOICFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOICFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOICFGR_GPIOxEN_Pos)
#define RCC_GPIOICFGR_GPIOxEN                        RCC_GPIOICFGR_GPIOxEN_Msk
#define RCC_GPIOICFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOICFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOICFGR_GPIOxLPEN_Pos)
#define RCC_GPIOICFGR_GPIOxLPEN                      RCC_GPIOICFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOJCFGR register */
#define RCC_GPIOJCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOJCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOJCFGR_GPIOxRST_Pos)
#define RCC_GPIOJCFGR_GPIOxRST                       RCC_GPIOJCFGR_GPIOxRST_Msk
#define RCC_GPIOJCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOJCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOJCFGR_GPIOxEN_Pos)
#define RCC_GPIOJCFGR_GPIOxEN                        RCC_GPIOJCFGR_GPIOxEN_Msk
#define RCC_GPIOJCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOJCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOJCFGR_GPIOxLPEN_Pos)
#define RCC_GPIOJCFGR_GPIOxLPEN                      RCC_GPIOJCFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOKCFGR register */
#define RCC_GPIOKCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOKCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOKCFGR_GPIOxRST_Pos)
#define RCC_GPIOKCFGR_GPIOxRST                       RCC_GPIOKCFGR_GPIOxRST_Msk
#define RCC_GPIOKCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOKCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOKCFGR_GPIOxEN_Pos)
#define RCC_GPIOKCFGR_GPIOxEN                        RCC_GPIOKCFGR_GPIOxEN_Msk
#define RCC_GPIOKCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOKCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOKCFGR_GPIOxLPEN_Pos)
#define RCC_GPIOKCFGR_GPIOxLPEN                      RCC_GPIOKCFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOZCFGR register */
#define RCC_GPIOZCFGR_GPIOZRST_Pos                   (0U)
#define RCC_GPIOZCFGR_GPIOZRST_Msk                   (0x1UL << RCC_GPIOZCFGR_GPIOZRST_Pos)
#define RCC_GPIOZCFGR_GPIOZRST                       RCC_GPIOZCFGR_GPIOZRST_Msk
#define RCC_GPIOZCFGR_GPIOZEN_Pos                    (1U)
#define RCC_GPIOZCFGR_GPIOZEN_Msk                    (0x1UL << RCC_GPIOZCFGR_GPIOZEN_Pos)
#define RCC_GPIOZCFGR_GPIOZEN                        RCC_GPIOZCFGR_GPIOZEN_Msk
#define RCC_GPIOZCFGR_GPIOZLPEN_Pos                  (2U)
#define RCC_GPIOZCFGR_GPIOZLPEN_Msk                  (0x1UL << RCC_GPIOZCFGR_GPIOZLPEN_Pos)
#define RCC_GPIOZCFGR_GPIOZLPEN                      RCC_GPIOZCFGR_GPIOZLPEN_Msk
#define RCC_GPIOZCFGR_GPIOZAMEN_Pos                  (3U)
#define RCC_GPIOZCFGR_GPIOZAMEN_Msk                  (0x1UL << RCC_GPIOZCFGR_GPIOZAMEN_Pos)
#define RCC_GPIOZCFGR_GPIOZAMEN                      RCC_GPIOZCFGR_GPIOZAMEN_Msk

/* Bit fields for RCC_HPDMA1CFGR register */
#define RCC_HPDMA1CFGR_HPDMA1RST_Pos                 (0U)
#define RCC_HPDMA1CFGR_HPDMA1RST_Msk                 (0x1UL << RCC_HPDMA1CFGR_HPDMA1RST_Pos)                /*!< 0x00000001 */
#define RCC_HPDMA1CFGR_HPDMA1RST                     RCC_HPDMA1CFGR_HPDMA1RST_Msk                          /*!< HPDMA1 reset */
#define RCC_HPDMA1CFGR_HPDMA1EN_Pos                  (1U)
#define RCC_HPDMA1CFGR_HPDMA1EN_Msk                  (0x1UL << RCC_HPDMA1CFGR_HPDMA1EN_Pos)                 /*!< 0x00000002 */
#define RCC_HPDMA1CFGR_HPDMA1EN                      RCC_HPDMA1CFGR_HPDMA1EN_Msk                           /*!< HPDMA1 clock enable */
#define RCC_HPDMA1CFGR_HPDMA1LPEN_Pos                (2U)
#define RCC_HPDMA1CFGR_HPDMA1LPEN_Msk                (0x1UL << RCC_HPDMA1CFGR_HPDMA1LPEN_Pos)               /*!< 0x00000004 */
#define RCC_HPDMA1CFGR_HPDMA1LPEN                    RCC_HPDMA1CFGR_HPDMA1LPEN_Msk                         /*!< HPDMA1 clock enable during CSleep */

/* Bit fields for RCC_HPDMA2CFGR register */
#define RCC_HPDMA2CFGR_HPDMA2RST_Pos                 (0U)
#define RCC_HPDMA2CFGR_HPDMA2RST_Msk                 (0x1UL << RCC_HPDMA2CFGR_HPDMA2RST_Pos)                /*!< 0x00000001 */
#define RCC_HPDMA2CFGR_HPDMA2RST                     RCC_HPDMA2CFGR_HPDMA2RST_Msk                          /*!< HPDMA2 reset */
#define RCC_HPDMA2CFGR_HPDMA2EN_Pos                  (1U)
#define RCC_HPDMA2CFGR_HPDMA2EN_Msk                  (0x1UL << RCC_HPDMA2CFGR_HPDMA2EN_Pos)                 /*!< 0x00000002 */
#define RCC_HPDMA2CFGR_HPDMA2EN                      RCC_HPDMA2CFGR_HPDMA2EN_Msk                           /*!< HPDMA2 clock enable */
#define RCC_HPDMA2CFGR_HPDMA2LPEN_Pos                (2U)
#define RCC_HPDMA2CFGR_HPDMA2LPEN_Msk                (0x1UL << RCC_HPDMA2CFGR_HPDMA2LPEN_Pos)               /*!< 0x00000004 */
#define RCC_HPDMA2CFGR_HPDMA2LPEN                    RCC_HPDMA2CFGR_HPDMA2LPEN_Msk                         /*!< HPDMA2 clock enable during CSleep */

/* Bit fields for RCC_HPDMA3CFGR register */
#define RCC_HPDMA3CFGR_HPDMA3RST_Pos                 (0U)
#define RCC_HPDMA3CFGR_HPDMA3RST_Msk                 (0x1UL << RCC_HPDMA3CFGR_HPDMA3RST_Pos)                /*!< 0x00000001 */
#define RCC_HPDMA3CFGR_HPDMA3RST                     RCC_HPDMA3CFGR_HPDMA3RST_Msk                          /*!< HPDMA3 reset */
#define RCC_HPDMA3CFGR_HPDMA3EN_Pos                  (1U)
#define RCC_HPDMA3CFGR_HPDMA3EN_Msk                  (0x1UL << RCC_HPDMA3CFGR_HPDMA3EN_Pos)                 /*!< 0x00000002 */
#define RCC_HPDMA3CFGR_HPDMA3EN                      RCC_HPDMA3CFGR_HPDMA3EN_Msk                           /*!< HPDMA3 clock enable */
#define RCC_HPDMA3CFGR_HPDMA3LPEN_Pos                (2U)
#define RCC_HPDMA3CFGR_HPDMA3LPEN_Msk                (0x1UL << RCC_HPDMA3CFGR_HPDMA3LPEN_Pos)               /*!< 0x00000004 */
#define RCC_HPDMA3CFGR_HPDMA3LPEN                    RCC_HPDMA3CFGR_HPDMA3LPEN_Msk                         /*!< HPDMA3 clock enable during CSleep */

/* Bit fields for RCC_LPDMACFGR register */
#define RCC_LPDMACFGR_LPDMARST_Pos                   (0U)
#define RCC_LPDMACFGR_LPDMARST_Msk                   (0x1UL << RCC_LPDMACFGR_LPDMARST_Pos)                  /*!< 0x00000001 */
#define RCC_LPDMACFGR_LPDMARST                       RCC_LPDMACFGR_LPDMARST_Msk                            /*!< LPDMA1 reset */
#define RCC_LPDMACFGR_LPDMAEN_Pos                    (1U)
#define RCC_LPDMACFGR_LPDMAEN_Msk                    (0x1UL << RCC_LPDMACFGR_LPDMAEN_Pos)                   /*!< 0x00000002 */
#define RCC_LPDMACFGR_LPDMAEN                        RCC_LPDMACFGR_LPDMAEN_Msk                             /*!< LPDMA1 clock enable */
#define RCC_LPDMACFGR_LPDMALPEN_Pos                  (2U)
#define RCC_LPDMACFGR_LPDMALPEN_Msk                  (0x1UL << RCC_LPDMACFGR_LPDMALPEN_Pos)                 /*!< 0x00000004 */
#define RCC_LPDMACFGR_LPDMALPEN                      RCC_LPDMACFGR_LPDMALPEN_Msk                           /*!< LPDMA1 clock enable during CSleep */
#define RCC_LPDMACFGR_LPDMAAMEN_Pos                  (3U)
#define RCC_LPDMACFGR_LPDMAAMEN_Msk                  (0x1UL << RCC_LPDMACFGR_LPDMAAMEN_Pos)                 /*!< 0x00000008 */
#define RCC_LPDMACFGR_LPDMAAMEN                      RCC_LPDMACFGR_LPDMAAMEN_Msk                           /*!< LPDMA1 autonomous clock mode enable */

/* Bit fields for RCC_HSEMCFGR register */
#define RCC_HSEMCFGR_HSEMRST_Pos                     (0U)
#define RCC_HSEMCFGR_HSEMRST_Msk                     (0x1UL << RCC_HSEMCFGR_HSEMRST_Pos)                    /*!< 0x00000001 */
#define RCC_HSEMCFGR_HSEMRST                         RCC_HSEMCFGR_HSEMRST_Msk                              /*!< HSEM reset */
#define RCC_HSEMCFGR_HSEMEN_Pos                      (1U)
#define RCC_HSEMCFGR_HSEMEN_Msk                      (0x1UL << RCC_HSEMCFGR_HSEMEN_Pos)                     /*!< 0x00000002 */
#define RCC_HSEMCFGR_HSEMEN                          RCC_HSEMCFGR_HSEMEN_Msk                               /*!< HSEM clock enable */
#define RCC_HSEMCFGR_HSEMLPEN_Pos                    (2U)
#define RCC_HSEMCFGR_HSEMLPEN_Msk                    (0x1UL << RCC_HSEMCFGR_HSEMLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_HSEMCFGR_HSEMLPEN                        RCC_HSEMCFGR_HSEMLPEN_Msk                             /*!< HSEM clock enable during CSleep */
#define RCC_HSEMCFGR_HSEMAMEN_Pos                    (3U)
#define RCC_HSEMCFGR_HSEMAMEN_Msk                    (0x1UL << RCC_HSEMCFGR_HSEMAMEN_Pos)                   /*!< 0x00000008 */
#define RCC_HSEMCFGR_HSEMAMEN                        RCC_HSEMCFGR_HSEMAMEN_Msk                             /*!< HSEM autonomous clock mode enable */

/* Bit fields for RCC_IPCC1CFGR register */
#define RCC_IPCC1CFGR_IPCC1RST_Pos                   (0U)
#define RCC_IPCC1CFGR_IPCC1RST_Msk                   (0x1UL << RCC_IPCC1CFGR_IPCC1RST_Pos)                  /*!< 0x00000001 */
#define RCC_IPCC1CFGR_IPCC1RST                       RCC_IPCC1CFGR_IPCC1RST_Msk                            /*!< IPCC1 reset */
#define RCC_IPCC1CFGR_IPCC1EN_Pos                    (1U)
#define RCC_IPCC1CFGR_IPCC1EN_Msk                    (0x1UL << RCC_IPCC1CFGR_IPCC1EN_Pos)                   /*!< 0x00000002 */
#define RCC_IPCC1CFGR_IPCC1EN                        RCC_IPCC1CFGR_IPCC1EN_Msk                             /*!< IPCC1 clock enable */
#define RCC_IPCC1CFGR_IPCC1LPEN_Pos                  (2U)
#define RCC_IPCC1CFGR_IPCC1LPEN_Msk                  (0x1UL << RCC_IPCC1CFGR_IPCC1LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_IPCC1CFGR_IPCC1LPEN                      RCC_IPCC1CFGR_IPCC1LPEN_Msk                           /*!< IPCC1 clock enable during CSleep */

/* Bit fields for RCC_IPCC2CFGR register */
#define RCC_IPCC2CFGR_IPCC2RST_Pos                   (0U)
#define RCC_IPCC2CFGR_IPCC2RST_Msk                   (0x1UL << RCC_IPCC2CFGR_IPCC2RST_Pos)                  /*!< 0x00000001 */
#define RCC_IPCC2CFGR_IPCC2RST                       RCC_IPCC2CFGR_IPCC2RST_Msk                            /*!< IPCC2 reset */
#define RCC_IPCC2CFGR_IPCC2EN_Pos                    (1U)
#define RCC_IPCC2CFGR_IPCC2EN_Msk                    (0x1UL << RCC_IPCC2CFGR_IPCC2EN_Pos)                   /*!< 0x00000002 */
#define RCC_IPCC2CFGR_IPCC2EN                        RCC_IPCC2CFGR_IPCC2EN_Msk                             /*!< IPCC2 clock enable */
#define RCC_IPCC2CFGR_IPCC2LPEN_Pos                  (2U)
#define RCC_IPCC2CFGR_IPCC2LPEN_Msk                  (0x1UL << RCC_IPCC2CFGR_IPCC2LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_IPCC2CFGR_IPCC2LPEN                      RCC_IPCC2CFGR_IPCC2LPEN_Msk                           /*!< IPCC2 clock enable during CSleep */
#define RCC_IPCC2CFGR_IPCC2AMEN_Pos                  (3U)
#define RCC_IPCC2CFGR_IPCC2AMEN_Msk                  (0x1UL << RCC_IPCC2CFGR_IPCC2AMEN_Pos)                 /*!< 0x00000008 */
#define RCC_IPCC2CFGR_IPCC2AMEN                      RCC_IPCC2CFGR_IPCC2AMEN_Msk                           /*!< IPCC2 autonomous clock mode enable */

/* Bit fields for RCC_RTCCFGR register */
#define RCC_RTCCFGR_RTCEN_Pos                        (1U)
#define RCC_RTCCFGR_RTCEN_Msk                        (0x1UL << RCC_RTCCFGR_RTCEN_Pos)                       /*!< 0x00000002 */
#define RCC_RTCCFGR_RTCEN                            RCC_RTCCFGR_RTCEN_Msk                                 /*!< RTC bus clock enable */
#define RCC_RTCCFGR_RTCLPEN_Pos                      (2U)
#define RCC_RTCCFGR_RTCLPEN_Msk                      (0x1UL << RCC_RTCCFGR_RTCLPEN_Pos)                     /*!< 0x00000004 */
#define RCC_RTCCFGR_RTCLPEN                          RCC_RTCCFGR_RTCLPEN_Msk                               /*!< RTC bus clock enable during CSleep */
#define RCC_RTCCFGR_RTCAMEN_Pos                      (3U)
#define RCC_RTCCFGR_RTCAMEN_Msk                      (0x1UL << RCC_RTCCFGR_RTCAMEN_Pos)                     /*!< 0x00000008 */
#define RCC_RTCCFGR_RTCAMEN                          RCC_RTCCFGR_RTCAMEN_Msk                               /*!< RTC autonomous clock mode enable */

/* Bit fields for RCC_SYSCPU1CFGR register */
#define RCC_SYSCPU1CFGR_SYSCPU1EN_Pos                (1U)
#define RCC_SYSCPU1CFGR_SYSCPU1EN_Msk                (0x1UL << RCC_SYSCPU1CFGR_SYSCPU1EN_Pos)               /*!< 0x00000002 */
#define RCC_SYSCPU1CFGR_SYSCPU1EN                    RCC_SYSCPU1CFGR_SYSCPU1EN_Msk                         /*!< CPU1 system configuration clock enable */
#define RCC_SYSCPU1CFGR_SYSCPU1LPEN_Pos              (2U)
#define RCC_SYSCPU1CFGR_SYSCPU1LPEN_Msk              (0x1UL << RCC_SYSCPU1CFGR_SYSCPU1LPEN_Pos)             /*!< 0x00000004 */
#define RCC_SYSCPU1CFGR_SYSCPU1LPEN                  RCC_SYSCPU1CFGR_SYSCPU1LPEN_Msk                       /*!< CPU1 system configuration clock enable during CSleep */

/* Bit fields for RCC_BSECCFGR register */
#define RCC_BSECCFGR_BSECEN_Pos                      (1U)
#define RCC_BSECCFGR_BSECEN_Msk                      (0x1UL << RCC_BSECCFGR_BSECEN_Pos)                     /*!< 0x00000002 */
#define RCC_BSECCFGR_BSECEN                          RCC_BSECCFGR_BSECEN_Msk                               /*!< BSEC clock enable */
#define RCC_BSECCFGR_BSECLPEN_Pos                    (2U)
#define RCC_BSECCFGR_BSECLPEN_Msk                    (0x1UL << RCC_BSECCFGR_BSECLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_BSECCFGR_BSECLPEN                        RCC_BSECCFGR_BSECLPEN_Msk 

