STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235cxx_ca35.h
/*******************  Bits definition for RISC_SECCFGR5 register **************/
#define RISC_SECCFGR5_SEC160_Pos      (0U)
#define RISC_SECCFGR5_SEC160_Msk      (0x1UL << RISC_SECCFGR5_SEC160_Pos)        /*!< 0x00000001 */
#define RISC_SECCFGR5_SEC160          RISC_SECCFGR5_SEC160_Msk
#define RISC_SECCFGR5_SEC161_Pos      (1U)
#define RISC_SECCFGR5_SEC161_Msk      (0x1UL << RISC_SECCFGR5_SEC161_Pos)        /*!< 0x00000002 */
#define RISC_SECCFGR5_SEC161          RISC_SECCFGR5_SEC161_Msk
#define RISC_SECCFGR5_SEC162_Pos      (2U)
#define RISC_SECCFGR5_SEC162_Msk      (0x1UL << RISC_SECCFGR5_SEC162_Pos)        /*!< 0x00000004 */
#define RISC_SECCFGR5_SEC162          RISC_SECCFGR5_SEC162_Msk
#define RISC_SECCFGR5_SEC163_Pos      (3U)
#define RISC_SECCFGR5_SEC163_Msk      (0x1UL << RISC_SECCFGR5_SEC163_Pos)        /*!< 0x00000008 */
#define RISC_SECCFGR5_SEC163          RISC_SECCFGR5_SEC163_Msk
#define RISC_SECCFGR5_SEC164_Pos      (4U)
#define RISC_SECCFGR5_SEC164_Msk      (0x1UL << RISC_SECCFGR5_SEC164_Pos)        /*!< 0x00000010 */
#define RISC_SECCFGR5_SEC164          RISC_SECCFGR5_SEC164_Msk
#define RISC_SECCFGR5_SEC165_Pos      (5U)
#define RISC_SECCFGR5_SEC165_Msk      (0x1UL << RISC_SECCFGR5_SEC165_Pos)        /*!< 0x00000020 */
#define RISC_SECCFGR5_SEC165          RISC_SECCFGR5_SEC165_Msk
#define RISC_SECCFGR5_SEC166_Pos      (6U)
#define RISC_SECCFGR5_SEC166_Msk      (0x1UL << RISC_SECCFGR5_SEC166_Pos)        /*!< 0x00000040 */
#define RISC_SECCFGR5_SEC166          RISC_SECCFGR5_SEC166_Msk
#define RISC_SECCFGR5_SEC167_Pos      (7U)
#define RISC_SECCFGR5_SEC167_Msk      (0x1UL << RISC_SECCFGR5_SEC167_Pos)        /*!< 0x00000080 */
#define RISC_SECCFGR5_SEC167          RISC_SECCFGR5_SEC167_Msk
#define RISC_SECCFGR5_SEC168_Pos      (8U)
#define RISC_SECCFGR5_SEC168_Msk      (0x1UL << RISC_SECCFGR5_SEC168_Pos)        /*!< 0x00000100 */
#define RISC_SECCFGR5_SEC168          RISC_SECCFGR5_SEC168_Msk
#define RISC_SECCFGR5_SEC169_Pos      (9U)
#define RISC_SECCFGR5_SEC169_Msk      (0x1UL << RISC_SECCFGR5_SEC169_Pos)        /*!< 0x00000200 */
#define RISC_SECCFGR5_SEC169          RISC_SECCFGR5_SEC169_Msk
#define RISC_SECCFGR5_SEC170_Pos      (10U)
#define RISC_SECCFGR5_SEC170_Msk      (0x1UL << RISC_SECCFGR5_SEC170_Pos)        /*!< 0x00000400 */
#define RISC_SECCFGR5_SEC170          RISC_SECCFGR5_SEC170_Msk
#define RISC_SECCFGR5_SEC171_Pos      (11U)
#define RISC_SECCFGR5_SEC171_Msk      (0x1UL << RISC_SECCFGR5_SEC171_Pos)        /*!< 0x00000800 */
#define RISC_SECCFGR5_SEC171          RISC_SECCFGR5_SEC171_Msk
#define RISC_SECCFGR5_SEC172_Pos      (12U)
#define RISC_SECCFGR5_SEC172_Msk      (0x1UL << RISC_SECCFGR5_SEC172_Pos)        /*!< 0x00001000 */
#define RISC_SECCFGR5_SEC172          RISC_SECCFGR5_SEC172_Msk
#define RISC_SECCFGR5_SEC173_Pos      (13U)
#define RISC_SECCFGR5_SEC173_Msk      (0x1UL << RISC_SECCFGR5_SEC173_Pos)        /*!< 0x00002000 */
#define RISC_SECCFGR5_SEC173          RISC_SECCFGR5_SEC173_Msk
#define RISC_SECCFGR5_SEC174_Pos      (14U)
#define RISC_SECCFGR5_SEC174_Msk      (0x1UL << RISC_SECCFGR5_SEC174_Pos)        /*!< 0x00004000 */
#define RISC_SECCFGR5_SEC174          RISC_SECCFGR5_SEC174_Msk
#define RISC_SECCFGR5_SEC175_Pos      (15U)
#define RISC_SECCFGR5_SEC175_Msk      (0x1UL << RISC_SECCFGR5_SEC175_Pos)        /*!< 0x00008000 */
#define RISC_SECCFGR5_SEC175          RISC_SECCFGR5_SEC175_Msk
#define RISC_SECCFGR5_SEC176_Pos      (16U)
#define RISC_SECCFGR5_SEC176_Msk      (0x1UL << RISC_SECCFGR5_SEC176_Pos)        /*!< 0x00010000 */
#define RISC_SECCFGR5_SEC176          RISC_SECCFGR5_SEC176_Msk
#define RISC_SECCFGR5_SEC177_Pos      (17U)
#define RISC_SECCFGR5_SEC177_Msk      (0x1UL << RISC_SECCFGR5_SEC177_Pos)        /*!< 0x00020000 */
#define RISC_SECCFGR5_SEC177          RISC_SECCFGR5_SEC177_Msk
#define RISC_SECCFGR5_SEC178_Pos      (18U)
#define RISC_SECCFGR5_SEC178_Msk      (0x1UL << RISC_SECCFGR5_SEC178_Pos)        /*!< 0x00040000 */
#define RISC_SECCFGR5_SEC178          RISC_SECCFGR5_SEC178_Msk
#define RISC_SECCFGR5_SEC179_Pos      (19U)
#define RISC_SECCFGR5_SEC179_Msk      (0x1UL << RISC_SECCFGR5_SEC179_Pos)        /*!< 0x00080000 */
#define RISC_SECCFGR5_SEC179          RISC_SECCFGR5_SEC179_Msk
#define RISC_SECCFGR5_SEC180_Pos      (20U)
#define RISC_SECCFGR5_SEC180_Msk      (0x1UL << RISC_SECCFGR5_SEC180_Pos)        /*!< 0x00100000 */
#define RISC_SECCFGR5_SEC180          RISC_SECCFGR5_SEC180_Msk
#define RISC_SECCFGR5_SEC181_Pos      (21U)
#define RISC_SECCFGR5_SEC181_Msk      (0x1UL << RISC_SECCFGR5_SEC181_Pos)        /*!< 0x00200000 */
#define RISC_SECCFGR5_SEC181          RISC_SECCFGR5_SEC181_Msk
#define RISC_SECCFGR5_SEC182_Pos      (22U)
#define RISC_SECCFGR5_SEC182_Msk      (0x1UL << RISC_SECCFGR5_SEC182_Pos)        /*!< 0x00400000 */
#define RISC_SECCFGR5_SEC182          RISC_SECCFGR5_SEC182_Msk
#define RISC_SECCFGR5_SEC183_Pos      (23U)
#define RISC_SECCFGR5_SEC183_Msk      (0x1UL << RISC_SECCFGR5_SEC183_Pos)        /*!< 0x00800000 */
#define RISC_SECCFGR5_SEC183          RISC_SECCFGR5_SEC183_Msk
#define RISC_SECCFGR5_SEC184_Pos      (24U)
#define RISC_SECCFGR5_SEC184_Msk      (0x1UL << RISC_SECCFGR5_SEC184_Pos)        /*!< 0x01000000 */
#define RISC_SECCFGR5_SEC184          RISC_SECCFGR5_SEC184_Msk
#define RISC_SECCFGR5_SEC185_Pos      (25U)
#define RISC_SECCFGR5_SEC185_Msk      (0x1UL << RISC_SECCFGR5_SEC185_Pos)        /*!< 0x02000000 */
#define RISC_SECCFGR5_SEC185          RISC_SECCFGR5_SEC185_Msk
#define RISC_SECCFGR5_SEC186_Pos      (26U)
#define RISC_SECCFGR5_SEC186_Msk      (0x1UL << RISC_SECCFGR5_SEC186_Pos)        /*!< 0x04000000 */
#define RISC_SECCFGR5_SEC186          RISC_SECCFGR5_SEC186_Msk
#define RISC_SECCFGR5_SEC187_Pos      (27U)
#define RISC_SECCFGR5_SEC187_Msk      (0x1UL << RISC_SECCFGR5_SEC187_Pos)        /*!< 0x08000000 */
#define RISC_SECCFGR5_SEC187          RISC_SECCFGR5_SEC187_Msk
#define RISC_SECCFGR5_SEC188_Pos      (28U)
#define RISC_SECCFGR5_SEC188_Msk      (0x1UL << RISC_SECCFGR5_SEC188_Pos)        /*!< 0x10000000 */
#define RISC_SECCFGR5_SEC188          RISC_SECCFGR5_SEC188_Msk
#define RISC_SECCFGR5_SEC189_Pos      (29U)
#define RISC_SECCFGR5_SEC189_Msk      (0x1UL << RISC_SECCFGR5_SEC189_Pos)        /*!< 0x20000000 */
#define RISC_SECCFGR5_SEC189          RISC_SECCFGR5_SEC189_Msk
#define RISC_SECCFGR5_SEC190_Pos      (30U)
#define RISC_SECCFGR5_SEC190_Msk      (0x1UL << RISC_SECCFGR5_SEC190_Pos)        /*!< 0x40000000 */
#define RISC_SECCFGR5_SEC190          RISC_SECCFGR5_SEC190_Msk
#define RISC_SECCFGR5_SEC191_Pos      (31U)
#define RISC_SECCFGR5_SEC191_Msk      (0x1UL << RISC_SECCFGR5_SEC191_Pos)        /*!< 0x80000000 */
#define RISC_SECCFGR5_SEC191          RISC_SECCFGR5_SEC191_Msk

/*******************  Bits definition for RISC_PRIVCFGR0 register *************/
#define RISC_PRIVCFGR0_PRIV0_Pos      (0U)
#define RISC_PRIVCFGR0_PRIV0_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV0_Pos)        /*!< 0x00000001 */
#define RISC_PRIVCFGR0_PRIV0          RISC_PRIVCFGR0_PRIV0_Msk
#define RISC_PRIVCFGR0_PRIV1_Pos      (1U)
#define RISC_PRIVCFGR0_PRIV1_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV1_Pos)        /*!< 0x00000002 */
#define RISC_PRIVCFGR0_PRIV1          RISC_PRIVCFGR0_PRIV1_Msk
#define RISC_PRIVCFGR0_PRIV2_Pos      (2U)
#define RISC_PRIVCFGR0_PRIV2_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV2_Pos)        /*!< 0x00000004 */
#define RISC_PRIVCFGR0_PRIV2          RISC_PRIVCFGR0_PRIV2_Msk
#define RISC_PRIVCFGR0_PRIV3_Pos      (3U)
#define RISC_PRIVCFGR0_PRIV3_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV3_Pos)        /*!< 0x00000008 */
#define RISC_PRIVCFGR0_PRIV3          RISC_PRIVCFGR0_PRIV3_Msk
#define RISC_PRIVCFGR0_PRIV4_Pos      (4U)
#define RISC_PRIVCFGR0_PRIV4_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV4_Pos)        /*!< 0x00000010 */
#define RISC_PRIVCFGR0_PRIV4          RISC_PRIVCFGR0_PRIV4_Msk
#define RISC_PRIVCFGR0_PRIV5_Pos      (5U)
#define RISC_PRIVCFGR0_PRIV5_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV5_Pos)        /*!< 0x00000020 */
#define RISC_PRIVCFGR0_PRIV5          RISC_PRIVCFGR0_PRIV5_Msk
#define RISC_PRIVCFGR0_PRIV6_Pos      (6U)
#define RISC_PRIVCFGR0_PRIV6_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV6_Pos)        /*!< 0x00000040 */
#define RISC_PRIVCFGR0_PRIV6          RISC_PRIVCFGR0_PRIV6_Msk
#define RISC_PRIVCFGR0_PRIV7_Pos      (7U)
#define RISC_PRIVCFGR0_PRIV7_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV7_Pos)        /*!< 0x00000080 */
#define RISC_PRIVCFGR0_PRIV7          RISC_PRIVCFGR0_PRIV7_Msk
#define RISC_PRIVCFGR0_PRIV8_Pos      (8U)
#define RISC_PRIVCFGR0_PRIV8_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV8_Pos)        /*!< 0x00000100 */
#define RISC_PRIVCFGR0_PRIV8          RISC_PRIVCFGR0_PRIV8_Msk
#define RISC_PRIVCFGR0_PRIV9_Pos      (9U)
#define RISC_PRIVCFGR0_PRIV9_Msk      (0x1UL << RISC_PRIVCFGR0_PRIV9_Pos)        /*!< 0x00000200 */
#define RISC_PRIVCFGR0_PRIV9          RISC_PRIVCFGR0_PRIV9_Msk
#define RISC_PRIVCFGR0_PRIV10_Pos     (10U)
#define RISC_PRIVCFGR0_PRIV10_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV10_Pos)       /*!< 0x00000400 */
#define RISC_PRIVCFGR0_PRIV10         RISC_PRIVCFGR0_PRIV10_Msk
#define RISC_PRIVCFGR0_PRIV11_Pos     (11U)
#define RISC_PRIVCFGR0_PRIV11_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV11_Pos)       /*!< 0x00000800 */
#define RISC_PRIVCFGR0_PRIV11         RISC_PRIVCFGR0_PRIV11_Msk
#define RISC_PRIVCFGR0_PRIV12_Pos     (12U)
#define RISC_PRIVCFGR0_PRIV12_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV12_Pos)       /*!< 0x00001000 */
#define RISC_PRIVCFGR0_PRIV12         RISC_PRIVCFGR0_PRIV12_Msk
#define RISC_PRIVCFGR0_PRIV13_Pos     (13U)
#define RISC_PRIVCFGR0_PRIV13_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV13_Pos)       /*!< 0x00002000 */
#define RISC_PRIVCFGR0_PRIV13         RISC_PRIVCFGR0_PRIV13_Msk
#define RISC_PRIVCFGR0_PRIV14_Pos     (14U)
#define RISC_PRIVCFGR0_PRIV14_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV14_Pos)       /*!< 0x00004000 */
#define RISC_PRIVCFGR0_PRIV14         RISC_PRIVCFGR0_PRIV14_Msk
#define RISC_PRIVCFGR0_PRIV15_Pos     (15U)
#define RISC_PRIVCFGR0_PRIV15_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV15_Pos)       /*!< 0x00008000 */
#define RISC_PRIVCFGR0_PRIV15         RISC_PRIVCFGR0_PRIV15_Msk
#define RISC_PRIVCFGR0_PRIV16_Pos     (16U)
#define RISC_PRIVCFGR0_PRIV16_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV16_Pos)       /*!< 0x00010000 */
#define RISC_PRIVCFGR0_PRIV16         RISC_PRIVCFGR0_PRIV16_Msk
#define RISC_PRIVCFGR0_PRIV17_Pos     (17U)
#define RISC_PRIVCFGR0_PRIV17_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV17_Pos)       /*!< 0x00020000 */
#define RISC_PRIVCFGR0_PRIV17         RISC_PRIVCFGR0_PRIV17_Msk
#define RISC_PRIVCFGR0_PRIV18_Pos     (18U)
#define RISC_PRIVCFGR0_PRIV18_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV18_Pos)       /*!< 0x00040000 */
#define RISC_PRIVCFGR0_PRIV18         RISC_PRIVCFGR0_PRIV18_Msk
#define RISC_PRIVCFGR0_PRIV19_Pos     (19U)
#define RISC_PRIVCFGR0_PRIV19_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV19_Pos)       /*!< 0x00080000 */
#define RISC_PRIVCFGR0_PRIV19         RISC_PRIVCFGR0_PRIV19_Msk
#define RISC_PRIVCFGR0_PRIV20_Pos     (20U)
#define RISC_PRIVCFGR0_PRIV20_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV20_Pos)       /*!< 0x00100000 */
#define RISC_PRIVCFGR0_PRIV20         RISC_PRIVCFGR0_PRIV20_Msk
#define RISC_PRIVCFGR0_PRIV21_Pos     (21U)
#define RISC_PRIVCFGR0_PRIV21_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV21_Pos)       /*!< 0x00200000 */
#define RISC_PRIVCFGR0_PRIV21         RISC_PRIVCFGR0_PRIV21_Msk
#define RISC_PRIVCFGR0_PRIV22_Pos     (22U)
#define RISC_PRIVCFGR0_PRIV22_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV22_Pos)       /*!< 0x00400000 */
#define RISC_PRIVCFGR0_PRIV22         RISC_PRIVCFGR0_PRIV22_Msk
#define RISC_PRIVCFGR0_PRIV23_Pos     (23U)
#define RISC_PRIVCFGR0_PRIV23_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV23_Pos)       /*!< 0x00800000 */
#define RISC_PRIVCFGR0_PRIV23         RISC_PRIVCFGR0_PRIV23_Msk
#define RISC_PRIVCFGR0_PRIV24_Pos     (24U)
#define RISC_PRIVCFGR0_PRIV24_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV24_Pos)       /*!< 0x01000000 */
#define RISC_PRIVCFGR0_PRIV24         RISC_PRIVCFGR0_PRIV24_Msk
#define RISC_PRIVCFGR0_PRIV25_Pos     (25U)
#define RISC_PRIVCFGR0_PRIV25_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV25_Pos)       /*!< 0x02000000 */
#define RISC_PRIVCFGR0_PRIV25         RISC_PRIVCFGR0_PRIV25_Msk
#define RISC_PRIVCFGR0_PRIV26_Pos     (26U)
#define RISC_PRIVCFGR0_PRIV26_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV26_Pos)       /*!< 0x04000000 */
#define RISC_PRIVCFGR0_PRIV26         RISC_PRIVCFGR0_PRIV26_Msk
#define RISC_PRIVCFGR0_PRIV27_Pos     (27U)
#define RISC_PRIVCFGR0_PRIV27_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV27_Pos)       /*!< 0x08000000 */
#define RISC_PRIVCFGR0_PRIV27         RISC_PRIVCFGR0_PRIV27_Msk
#define RISC_PRIVCFGR0_PRIV28_Pos     (28U)
#define RISC_PRIVCFGR0_PRIV28_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV28_Pos)       /*!< 0x10000000 */
#define RISC_PRIVCFGR0_PRIV28         RISC_PRIVCFGR0_PRIV28_Msk
#define RISC_PRIVCFGR0_PRIV29_Pos     (29U)
#define RISC_PRIVCFGR0_PRIV29_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV29_Pos)       /*!< 0x20000000 */
#define RISC_PRIVCFGR0_PRIV29         RISC_PRIVCFGR0_PRIV29_Msk
#define RISC_PRIVCFGR0_PRIV30_Pos     (30U)
#define RISC_PRIVCFGR0_PRIV30_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV30_Pos)       /*!< 0x40000000 */
#define RISC_PRIVCFGR0_PRIV30         RISC_PRIVCFGR0_PRIV30_Msk
#define RISC_PRIVCFGR0_PRIV31_Pos     (31U)
#define RISC_PRIVCFGR0_PRIV31_Msk     (0x1UL << RISC_PRIVCFGR0_PRIV31_Pos)       /*!< 0x80000000 */
#define RISC_PRIVCFGR0_PRIV31         RISC_PRIVCFGR0_PRIV31_Msk

/*******************  Bits definition for RISC_PRIVCFGR1 register *************/
#define RISC_PRIVCFGR1_PRIV32_Pos     (0U)
#define RISC_PRIVCFGR1_PRIV32_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV32_Pos)       /*!< 0x00000001 */
#define RISC_PRIVCFGR1_PRIV32         RISC_PRIVCFGR1_PRIV32_Msk
#define RISC_PRIVCFGR1_PRIV33_Pos     (1U)
#define RISC_PRIVCFGR1_PRIV33_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV33_Pos)       /*!< 0x00000002 */
#define RISC_PRIVCFGR1_PRIV33         RISC_PRIVCFGR1_PRIV33_Msk
#define RISC_PRIVCFGR1_PRIV34_Pos     (2U)
#define RISC_PRIVCFGR1_PRIV34_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV34_Pos)       /*!< 0x00000004 */
#define RISC_PRIVCFGR1_PRIV34         RISC_PRIVCFGR1_PRIV34_Msk
#define RISC_PRIVCFGR1_PRIV35_Pos     (3U)
#define RISC_PRIVCFGR1_PRIV35_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV35_Pos)       /*!< 0x00000008 */
#define RISC_PRIVCFGR1_PRIV35         RISC_PRIVCFGR1_PRIV35_Msk
#define RISC_PRIVCFGR1_PRIV36_Pos     (4U)
#define RISC_PRIVCFGR1_PRIV36_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV36_Pos)       /*!< 0x00000010 */
#define RISC_PRIVCFGR1_PRIV36         RISC_PRIVCFGR1_PRIV36_Msk
#define RISC_PRIVCFGR1_PRIV37_Pos     (5U)
#define RISC_PRIVCFGR1_PRIV37_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV37_Pos)       /*!< 0x00000020 */
#define RISC_PRIVCFGR1_PRIV37         RISC_PRIVCFGR1_PRIV37_Msk
#define RISC_PRIVCFGR1_PRIV38_Pos     (6U)
#define RISC_PRIVCFGR1_PRIV38_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV38_Pos)       /*!< 0x00000040 */
#define RISC_PRIVCFGR1_PRIV38         RISC_PRIVCFGR1_PRIV38_Msk
#define RISC_PRIVCFGR1_PRIV39_Pos     (7U)
#define RISC_PRIVCFGR1_PRIV39_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV39_Pos)       /*!< 0x00000080 */
#define RISC_PRIVCFGR1_PRIV39         RISC_PRIVCFGR1_PRIV39_Msk
#define RISC_PRIVCFGR1_PRIV40_Pos     (8U)
#define RISC_PRIVCFGR1_PRIV40_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV40_Pos)       /*!< 0x00000100 */
#define RISC_PRIVCFGR1_PRIV40         RISC_PRIVCFGR1_PRIV40_Msk
#define RISC_PRIVCFGR1_PRIV41_Pos     (9U)
#define RISC_PRIVCFGR1_PRIV41_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV41_Pos)       /*!< 0x00000200 */
#define RISC_PRIVCFGR1_PRIV41         RISC_PRIVCFGR1_PRIV41_Msk
#define RISC_PRIVCFGR1_PRIV42_Pos     (10U)
#define RISC_PRIVCFGR1_PRIV42_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV42_Pos)       /*!< 0x00000400 */
#define RISC_PRIVCFGR1_PRIV42         RISC_PRIVCFGR1_PRIV42_Msk
#define RISC_PRIVCFGR1_PRIV43_Pos     (11U)
#define RISC_PRIVCFGR1_PRIV43_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV43_Pos)       /*!< 0x00000800 */
#define RISC_PRIVCFGR1_PRIV43         RISC_PRIVCFGR1_PRIV43_Msk
#define RISC_PRIVCFGR1_PRIV44_Pos     (12U)
#define RISC_PRIVCFGR1_PRIV44_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV44_Pos)       /*!< 0x00001000 */
#define RISC_PRIVCFGR1_PRIV44         RISC_PRIVCFGR1_PRIV44_Msk
#define RISC_PRIVCFGR1_PRIV45_Pos     (13U)
#define RISC_PRIVCFGR1_PRIV45_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV45_Pos)       /*!< 0x00002000 */
#define RISC_PRIVCFGR1_PRIV45         RISC_PRIVCFGR1_PRIV45_Msk
#define RISC_PRIVCFGR1_PRIV46_Pos     (14U)
#define RISC_PRIVCFGR1_PRIV46_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV46_Pos)       /*!< 0x00004000 */
#define RISC_PRIVCFGR1_PRIV46         RISC_PRIVCFGR1_PRIV46_Msk
#define RISC_PRIVCFGR1_PRIV47_Pos     (15U)
#define RISC_PRIVCFGR1_PRIV47_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV47_Pos)       /*!< 0x00008000 */
#define RISC_PRIVCFGR1_PRIV47         RISC_PRIVCFGR1_PRIV47_Msk
#define RISC_PRIVCFGR1_PRIV48_Pos     (16U)
#define RISC_PRIVCFGR1_PRIV48_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV48_Pos)       /*!< 0x00010000 */
#define RISC_PRIVCFGR1_PRIV48         RISC_PRIVCFGR1_PRIV48_Msk
#define RISC_PRIVCFGR1_PRIV49_Pos     (17U)
#define RISC_PRIVCFGR1_PRIV49_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV49_Pos)       /*!< 0x00020000 */
#define RISC_PRIVCFGR1_PRIV49         RISC_PRIVCFGR1_PRIV49_Msk
#define RISC_PRIVCFGR1_PRIV50_Pos     (18U)
#define RISC_PRIVCFGR1_PRIV50_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV50_Pos)       /*!< 0x00040000 */
#define RISC_PRIVCFGR1_PRIV50         RISC_PRIVCFGR1_PRIV50_Msk
#define RISC_PRIVCFGR1_PRIV51_Pos     (19U)
#define RISC_PRIVCFGR1_PRIV51_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV51_Pos)       /*!< 0x00080000 */
#define RISC_PRIVCFGR1_PRIV51         RISC_PRIVCFGR1_PRIV51_Msk
#define RISC_PRIVCFGR1_PRIV52_Pos     (20U)
#define RISC_PRIVCFGR1_PRIV52_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV52_Pos)       /*!< 0x00100000 */
#define RISC_PRIVCFGR1_PRIV52         RISC_PRIVCFGR1_PRIV52_Msk
#define RISC_PRIVCFGR1_PRIV53_Pos     (21U)
#define RISC_PRIVCFGR1_PRIV53_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV53_Pos)       /*!< 0x00200000 */
#define RISC_PRIVCFGR1_PRIV53         RISC_PRIVCFGR1_PRIV53_Msk
#define RISC_PRIVCFGR1_PRIV54_Pos     (22U)
#define RISC_PRIVCFGR1_PRIV54_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV54_Pos)       /*!< 0x00400000 */
#define RISC_PRIVCFGR1_PRIV54         RISC_PRIVCFGR1_PRIV54_Msk
#define RISC_PRIVCFGR1_PRIV55_Pos     (23U)
#define RISC_PRIVCFGR1_PRIV55_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV55_Pos)       /*!< 0x00800000 */
#define RISC_PRIVCFGR1_PRIV55         RISC_PRIVCFGR1_PRIV55_Msk
#define RISC_PRIVCFGR1_PRIV56_Pos     (24U)
#define RISC_PRIVCFGR1_PRIV56_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV56_Pos)       /*!< 0x01000000 */
#define RISC_PRIVCFGR1_PRIV56         RISC_PRIVCFGR1_PRIV56_Msk
#define RISC_PRIVCFGR1_PRIV57_Pos     (25U)
#define RISC_PRIVCFGR1_PRIV57_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV57_Pos)       /*!< 0x02000000 */
#define RISC_PRIVCFGR1_PRIV57         RISC_PRIVCFGR1_PRIV57_Msk
#define RISC_PRIVCFGR1_PRIV58_Pos     (26U)
#define RISC_PRIVCFGR1_PRIV58_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV58_Pos)       /*!< 0x04000000 */
#define RISC_PRIVCFGR1_PRIV58         RISC_PRIVCFGR1_PRIV58_Msk
#define RISC_PRIVCFGR1_PRIV59_Pos     (27U)
#define RISC_PRIVCFGR1_PRIV59_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV59_Pos)       /*!< 0x08000000 */
#define RISC_PRIVCFGR1_PRIV59         RISC_PRIVCFGR1_PRIV59_Msk
#define RISC_PRIVCFGR1_PRIV60_Pos     (28U)
#define RISC_PRIVCFGR1_PRIV60_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV60_Pos)       /*!< 0x10000000 */
#define RISC_PRIVCFGR1_PRIV60         RISC_PRIVCFGR1_PRIV60_Msk
#define RISC_PRIVCFGR1_PRIV61_Pos     (29U)
#define RISC_PRIVCFGR1_PRIV61_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV61_Pos)       /*!< 0x20000000 */
#define RISC_PRIVCFGR1_PRIV61         RISC_PRIVCFGR1_PRIV61_Msk
#define RISC_PRIVCFGR1_PRIV62_Pos     (30U)
#define RISC_PRIVCFGR1_PRIV62_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV62_Pos)       /*!< 0x40000000 */
#define RISC_PRIVCFGR1_PRIV62         RISC_PRIVCFGR1_PRIV62_Msk
#define RISC_PRIVCFGR1_PRIV63_Pos     (31U)
#define RISC_PRIVCFGR1_PRIV63_Msk     (0x1UL << RISC_PRIVCFGR1_PRIV63_Pos)       /*!< 0x80000000 */
#define RISC_PRIVCFGR1_PRIV63         RISC_PRIVCFGR1_PRIV63_Msk

